package main

import (
	"fmt"
)

func main() {

	slice1 := []int{1, 6, 2, 5, 8, 2}
	fmt.Println(MaxSumWithNegative(slice1, 3))
}

/*
Функция MaxSumWithNegative(numbers []int, k int) []int принимает слайс целых чисел и целое число k. Она должна вернуть новый слайс, содержащий значения подслайса длиной k, который:

имеет максимальную сумму среди всех подслайсов длины k.
содержит хотя бы одно отрицательное число.
Если подходящих подслайсов несколько с одинаковой максимальной суммой, вернуть первый (с наименьшим индексом начала).

Если k <= 0 или k больше длины переданного слайса, либо среди подслайсов длины k нет ни одного, содержащего отрицательное число, функция должна вернуть nil.

Под "подслайсом" понимается последовательно расположенные значения в оригинальном слайсе.

Пример:

Представим, что функция вызывается таким образом: MaxSumWithNegative([]int{-1, 6, 2, 5, 8, -2}, 3)
Функция должна найти и вернуть слайс с наибольшей суммой значений среди всех подслайсов, в которых будет три значения. Определим какие подслайсы есть в переданном слайсе:

-1, 6, 2
6, 2, 5
2, 5, 8
5, 8, -2

Необходимо найти подслайс с самой большой суммой значений и вернуть его, при этом, в подслайсе должно быть как минимум одно отрицательное число. В данном примере это будет последний слайс, именно его нам и нужно вернуть.
*/

func MaxSumWithNegative(numbers []int, k int) []int {

	if k <= 0 || k > len(numbers) {
		return nil
	}

	length := len(numbers) - k + 1     // количество подслайсов длиной k в исходном слайсе (в зависмости длины исх слайса)
	slice2 := make([][]int, length)    // создаем слайс слайсов, в который будем записывать  подслайсы длиной k
	sliceSumm := make([]int, length)   // слайс, в который будем помещать суммы сабслайсов сождержащих отриц. значения
	sliceResult := make([]int, length) // слайс, в который будем помещать результрующий сабслайс

	for i := 0; i < length; i++ { // получаем подслайсы и записываем их в двумерный слайс
		slice2[i] = numbers[i : i+k]
	}

	negativeCounter := 0
	for i, subSlice := range slice2 { // проходимся по подслайсам, считаем суммы и выбираем слайсы с отриц. числом

		negativeVal := false
		summ := 0

		for _, val := range subSlice {
			if val < 0 {
				negativeVal = true
			}
			summ += val
		}
		if negativeVal { // кладем суммы нужных нам слайсов в соответствующий индекс.
			sliceSumm[i] = summ
			negativeCounter++
		}
	}
	if negativeCounter == 0 {
		return nil
	}

	maxVal := sliceSumm[0]
	index := 0
	for i, val := range sliceSumm { // ищем наибольшее значение в полученных суммах подслайсов и сохраняем само значение и индекс
		if val > maxVal {
			maxVal = val
			index = i

		}
		if sliceSumm[i] == maxVal { // проверяем если max значение совпало, то проверяем минимальный первый элемент подслайса
			if slice2[i][0] < slice2[index][0] {
				index = i
			}
		}
	}
	sliceResult = slice2[index] // возвращаем подслайс с соответствующим индексом слайса sliceSumm максимального значения
	return sliceResult
}
